package j20220805.Board;

public class hint {
    /*
    Interface : 이름 나이 주소 이메일
    추상클래스 Factory (비즈니스 로직) << 실질적 모든 업무 처리

    공지사항, 자유게시판, Gwang_1 게시판
    board 1,2,3

    회원가입 , 로그인, 검색, 파일 입출력
    데이터베이스를 파일로 사용한다.

    콘솔로 로그인, 회원가입

    모든 입출력은 파일로 이루어진다.
    정보값도 파일로 이루어진다
    console에서 댓글이면 띄어쓰기로 처리
    해당하는 게시판은 하나의 파일을 가진다.
    로그인, 회원가입, 로그인해야 글을 읽을 수 있다.
    해당하는 로그인은 각각틀리다.
    게시판은 무한으로 만들 수 있다.
    해당하는 글은 로그인해야 읽을 수 있다.
    입력, 수정, 삭제 읽기
    쿠키 세션

    1. 기본 게시판
    2, 응용 게시판
    3. 실전 게시판
    4. 공통 게시판
    5. 댓글 게시판

    */
}
